{
    "clip1": "The process begins with downloading invoices from the USAble Life carrier portal. The login information, including username and password, can be found in the Box Mailbox Carrier Login Portal.",
    "clip2": "Find the carrier information, including usernames and passwords, on the carrier login portal.",
    "clip3": "Open the carrier portal directly from the spreadsheet, enter the username and password on the webpage, and log into the account.",
    "clip4": "Enter the User ID and Password, then click the \"Log in to my account\" button.",
    "clip5": "Navigate to the 'Billing & Payments' section on the home page.",
    "clip6": "Access the \"Billing History\" section by going to the \"Billing & Payments\" option at the top and selecting \"Billing History\" from the dropdown menu.",
    "clip7": "View all invoices in the \"Billing History\" section.",
    "clip8": "Download the billing history in either PDF or Excel format. PDF is recommended for general use, while Excel is useful for validation purposes.",
    "clip9": "Click on the \"Download PDF\" button in the \"Choose File Format\" section, then select \"Open File\" in the Downloads window.",
    "clip10": "After downloading the file, rename it using the correct naming convention, which can be found within the mailbox for the previous month.",
    "clip11": "Copy the name of the file and change the month as needed.",
    "clip12": "Rename the downloaded file from a sequence of numbers to a format like \"USAble-Gunn Creel FL-Dec\", then update the month accordingly (e.g., to \"Jan\").",
    "clip13": "After renaming, upload the file to two folders, starting with the AP Master folder.",
    "clip14": "Drag the renamed file (e.g., USABLE - Gunn Creel FL - Jan-25.pdf) into the corresponding month's folder (e.g., Jan-25 folder).",
    "clip15": "Upload the PDF document to the Box folder.",
    "clip16": "Open the downloaded file to update the invoice number and report download/upload date in the Box.",
    "clip17": "Locate the invoice number in the client billing log.",
    "clip18": "Add the invoice number to the client billing log spreadsheet.",
    "clip19": "Fill in the amount due and the date in the appropriate columns of the Excel sheet.",
    "clip20": "Upload the updated information."
}