{
    "steps": [
        "Okay, I understand. Here's the information you requested:\n\nStep 1: The video introduces the download of invoices from the USAble Life carrier portal, using the carrier information in the shown spreadsheet.",
        "Okay, here's a summary of the current step:\n\nStep 2: The video explains how to find carrier information, including usernames and passwords, on a carrier login portal.\n",
        "Step 3: After opening the carrier portal directly from the spreadsheet, add the username and password on the webpage and log into the account.",
        "Step 4: After entering the User ID and Password, the \"Log in to my account\" button is clicked.",
        "Step 5: The speaker highlights that there are two options for downloading billing invoices. One is through the 'Billing and Payments' button on the screen.\n",
        "Step 6: The video explains how to access the \"Billing History\" section of the AccessAble website. It instructs the user to go to the \"Billing & Payments\" option at the top and then select \"Billing History\" from the dropdown menu.",
        "Step 7: This video shows the final steps to view your invoices. You can see all of your invoices by clicking the download button.",
        "Step 8: The video explains that you can download the billing history in two formats, PDF or Excel. The user mentions that they usually download in PDF, but for validation, they can also download in Excel.",
        "Step 9: The user clicks on the \"Download PDF\" button in the \"Choose File Format\" section, then selects \"Open File\" in the Downloads window.",
        "Okay, here's a summary of the video, formatted as requested:\n\nStep 10: After downloading a file, you need to rename it using the correct name, found within the mailbox for the previous month.\n",
        "Step 11: The user copies the name of the file and changes the month as needed.",
        "Step 12: The file on the computer is renamed from a sequence of numbers to \"USAble-Gunn Creel FL-Dec\". The user then changes \"Dec\" to \"Jan\".",
        "Step 13: After the file has been renamed, it can be uploaded to two folders, the first one being AP Master.",
        "Step 14: In this part of the step-by-step process, the file USABLE - Gunn Creel FL - Jan-25.pdf is dragged into the Jan-25 folder.",
        "Step 15: The user uploads a PDF document to the Box folder.",
        "Step 16: The user opens the downloaded file to update the invoice number and report download/upload date in the box.",
        "Step 17: The invoice number is located in the client billing log.\n",
        "Step 18: The user adds the invoice number to the spreadsheet.",
        "Step 19: The user fills in the amount due and the date in the appropriate columns of the Excel sheet.",
        "Step 20: The video explains how to upload information."
    ]
}